[
    {
        "problem_name": 1,
        "desc": "What importance factor should be used for the design of a hospital?",
        "problem_pic": "{\"src\": \"example.png\", \"alt\": \"example picture\"}",
        "answer": 1.5,
        "answers": "[0.5, 1, 1.25, 1.5]",
        "answer_desc": "The Seismic Importance Factor or 'Ie' is determined in chapter 1 of ASCE 7. First the risk category of the proposed structure is assessed, and then the risk category is used to determine the Seismic Importance Factor. Start by evaluating the structure (hospital) in table 1.5-1, a hospital is typically considered an essential facility. This qualifies the structure as Risk Category IV. Now enter table 1.5-2, for a Risk Category IV structure the Seismic Importance Factor is listed as 1.5",
        "category": "[\"category1\", \"category2\"]"
    },
    {
        "problem_name": 2,
        "desc": "What redundancy factor should be used for the design of a structure with a single bay of steel moment frame on each side? Assume seismic design category D.",
        "problem_pic": "{\"src\": \"05_lao_08_q.PNG\", \"alt\": \"Problem 5 Image\"} ",
        "answer": 1.4,
        "answers": "[1, 1.2, 1.3, 1.4]",
        "answer_desc": "Per ASCE 7 12.3.4.2, we evaluate a structure with a single bay of lateral resistance at each perimeter side. A structure should use a ro = 1.3 unless condition (a) or (b) is met. Condition (a) is not met because losing moment resistance at the beam-to-column connection of a single beam would create a %50 loss in story strength for the listed structure. Condition (b) is not met because it would require 2 bays on each perimeter side, in our case there is only 1 on each side. Therefore if neither condition (a) or (b) is met, the redundancy factor shall be taken as 1.3",
        "category": "[]"
    },
    {
        "problem_name": 3,
        "desc": "What building is most likely to require consideration of accidental moment due to torsion?",
        "problem_pic": "{\"src\": \"05_lao_08_q.PNG\", \"alt\": \"Problem 5 Image\"} ",
        "answer": "A 3 story office building with concrete floors",
        "answers": "[\"A single story carport with untopped metal deck roof\", \"A 4 story house framed with light framed wood construction\", \"A 3 story office building with concrete floors\", \"A single story warehouse with a timber framed roof with wood roof sheathing.\"]",
        "answer_desc": "Per ASCE 7 12.8.4.2, we evaluate if torsional moment is required to be included in the analysis. Torsional moment is only required for rigid diaphragms. Then checking ASCE 7 12.3.1.1, a flexible diaphragm is typically allowed for untopped steel decking or wood structural panels (sheathing). Per ASCE 7 12.3.1.2, concrete slab or concrete filled metal deck may be rigid. Note that more information would be needed to qualify the diaphragms, but the most likely structure to have a rigid diaphragm is the one with the most rigid diaphragm, therefore the concrete floor."
    },
    {
        "problem_name": 4,
        "desc": "Which of the following requires continuous special inspection:",
        "answer": "Expansion anchor post installed into the underside of a concrete floor slab",
        "answers": "[\"Installation of open-web steel joists\", \"Expansion anchor post installed into the underside of a concrete floor slab\", \"Erection of precast concrete members\", \"All of the above\"]",
        "answer_desc": "Per the 2016 CBC Table 1705.2.3, open-web steel joists do not require special inspection. Per 2016 CBC 1705.3, anchors that are post installed into hardened concrete require special inspection depending on their installation. Because (B) states the anchor is installed onto the underside of a concrete floor slab, we can infer it will resist sustained tension loads. Table 1705.3 notes that erection of precast concrete members only requires periodic inspection. Thus the answer is (B)."
    },
    {
        "problem_name": 5,
        "desc": "Who must the registered civil engineer submit a statement of special inspections to?",
        "answer": "The local jurisdiction having authority",
        "answers": "[\"The project architect\", \"The project contractor\", \"The local jurisdiction having authority\", \"The state government\"]",
        "answer_desc": "The local jurisdiction having authority is the most appropriate answer. Per 2017 CBC Section 1704.1, \"Special inspections and tests, statements of special inspections, responsibilities of contractors, submittals to the building official and structural observations shall meet the applicable requirements of this section.\" Typically this is a county or city building department which has jurisdiction over the location of the proposed job. Local jurisdictions will have their own set of requirements for issuance of a permit, and typically have a personalized statement of special inspections that the Engineer of Record signs."
    },
    {
        "problem_name": 6,
        "desc": "Which of these lateral resisting systems is the most ductile?",
        "answer": "Steel Special Moment Frame",
        "answers": "[\"Ordinary Reinforced Concrete Shear Wall\", \"Special Reinforced Masonry Shearwall\", \"Steel Special Moment Frame\", \"Steel Special Cantilever column system\"]",
        "answer_desc": "ASCE 7 Tabe 12.2-1 gives a list of building lateral systems and the corresponding R values, which represent ductility. A larger R value indicates more capability to undergo inelastic deformation, meaning a more ductile system. Therefore a Special Steel Moment Frame is most ductile with R = 8"
    },
    {
        "problem_name": 7,
        "desc": "What seismic importance factor should be used for the design of a prison?",
        "answer": 1.25,
        "answers": "[1, 1.15, 1.25, 1.5]",
        "answer_desc": "The Seismic Importance Factor or 'Ie' is determined in chapter 1 of ASCE 7. First the risk category of the proposed structure is assessed, and then the risk category is used to determine the Seismic Importance Factor. Start by evaluating the structure (prison) in table 1.5-1, because of the potentially large amount of people that are always in the prison, it is appropriate to be category III. Now using table 1.5-2, for a Risk Category III structure the Seismic Importance Factor is listed as 1.25 (Note that some prison systems in California override this typical categorization and require an automatic Risk Category IV, however for the seismic exam the most typical answer will be correct)"
    },
    {
        "problem_name": 8,
        "desc": "What ASCE 7 seismic load combination will typically produce the largest overturning moment?",
        "answer": "0.9D + 1.0E",
        "answers": "[\"1.2D + 1.0E\", \"0.9D + 1.0E\", \"1.2D + 1.6L\", \"1.4D\"]",
        "answer_desc": "Only those combinations with the 'E' term are seismic loads, so (1.2D + 1.6L) and (1.4D) do not apply. Since (1.2D + 1.0E) and (0.9D + 1.0E) both have a mutiplier of 1.0E, the only difference is the dead load. The smaller dead load will have the least overturning resistance, therefore 0.9D + 1.0E is the appropriate answer. Other questions on the exam may require you to solve for tension uplift forces on a structure or component, so it is valuable to be familiar with the relevant combinations."
    },
    {
        "problem_name": 9,
        "desc": "What ASCE 7 seismic load combination would be expected to produce the largest compression force in a column of a single bay lateral resisting frame?",
        "answer": "1.2D + 1.0E",
        "answers": "[\"1.2D + 1.0E\", \"0.9D + 1.0E\", \"1.2D + 1.6L\", \"1.4D\"]",
        "answer_desc": "Only two of the answers have a seismic component 'E.' Of those two, that with greater dead load would be expected to produce the greater compression force. Therefore (1.2D + 1.0E) is correct. Some other questions on the seismic exam may require solving for maximum compression forces without being told which load combinations to use, so it is valuable to be familiar with the relevant combinations."
    },
    {
        "problem_name": 10,
        "desc": "What factor for a lateral resisting system represents its inherent ductility?",
        "answer": "R",
        "answers": "[\"Cd\", \"Ie\", \"E\", \"R\"]",
        "answer_desc": "The 'R' factor or 'Response Modification Coefficient' represents the ability of a structural system to undergo inelastic deformations."
    },
    {
        "problem_name": 11,
        "desc": "What analytical procedure is not permitted for a structure with extreme torsional irregularity?",
        "answer": "Equivalent Lateral Force Procedure",
        "answers": "[\"Equivalent Lateral Force Procedure\", \"Modal Response Spectrum Analysis\", \"Linear Response History Analysis\", \"Nonlinear Response History Procedure\"]",
        "answer_desc": "Per ASCE 7 Table 12.5-1, the Equivalent Lateral Force Procedure may only be used with structures that have certain irregularities. An extreme torsional irregularity is a horizontal irregularity of Type 1b in Table 12.3-1. Only Type 2, 3, 4 or 5 is allowed for ELFP. Therefore a type 1 horizontal irregularity is not permitted for ELFP. All other analytical procedures are allowed for this irregularity because they can more accurately capture the effects."
    },
    {
        "problem_name": 12,
        "desc": "The reason for using the Importance Factor in building design is to:",
        "answer": "Add a higher factor of safety for more important structures",
        "answers": "[\"Add a higher factor of safety for more important structures\", \"Scale the seismic design forces to a more accurate level\", \"Account for the inherent ductility in a structure\", \"Force engineers to consider using seismic systems with greater ductility\"]",
        "answer_desc": "The importance factor is a man-made adjustment factor that amplifies seismic demand, therefore increasing the required strength of a structure. It does not make the seismic demand more accurate, or account for ducility, or force engineers to use a better seismic system."
    },
    {
        "problem_name": 13,
        "desc": "What is the minimum base shear for a nonbuilding structure not similar to a building? Assume S1 = 0.5g, T = 2s.",
        "answer": "V = 0.044SdsIeW",
        "answers": "[\"V = 0.044SdsIeW\", \"V = 0.8S1/(R/Ie)\", \"V = 0.5S1/(R/Ie)\", \"V = 0.30SdsWIe\"]",
        "answer_desc": "ASCE 7 eqn 15.4-1, section 15.4.1 specifies a minimum Cs of 0.044SdsIe. Because S1 < 0.6g eqn 15.4-2 is not applicable"
    },
    {
        "problem_name": 14,
        "desc": "When can the upper limit on the period of a steel moment frame building be ignored?",
        "answer": "When determining the drift",
        "answers": "[\"When determining the seismic base shear\", \"When determining the drift\", \"When an extreme horizontal irregularity exists\", \"When a 3D model of the building structure is used for analysis\"]",
        "answer_desc": "The correct answer is when performing drift calculations. The intent of the drift limit is to prevent an unreasonably small base shear for strength design, but when calculating drift is more relevant to have an accurate drift."
    },
    {
        "problem_name": 15,
        "desc": "A 30'x30' single story barn is proposed at a site with soft clay in the upper 100ft of the site profile. What is the approriate seismic design category for this structure? Ss = 0.5, S1 = 0.3",
        "answer": "D",
        "answers": "[\"E\", \"B\", \"C\", \"D\"]",
        "answer_desc": "Per ASCE 7 Table 20.3-1, a site with soft clay soil is considered site class E. Per section 20.3.1, note 4, a site with thick soft stiff clay layers of depth greater than 120 ft may be established as site class F. However the problem statement only suggests a soft clay characterization, and only in the upper 100ft. Using site class E, we check Table 11.4-1 to determine Fa = 1.7, Sms = FaSs = 1.7 x 0.5 = 0.85. Sds = 2/3Sms = 2/3x0.85 = 0.567. Per table 11.6-1 a site with Sds > 0.50 for a risk Category I structure is Seismic Design Category D. There is no need to check Table 11.6-2 because S1 < 0.7"
    },
    {
        "problem_name": 16,
        "desc": "A 10 story building with single bays of special steel moment resisting frames on each side is being checked for drift. What is the appropriate ro factor? Assume seismic diesgn category D.",
        "answer": 1,
        "answers": "[0, 0.5, 1, 1.3]",
        "answer_desc": "Per ASCE 12.3.4.1 note 2, ro is equal to 1.0 for drift calculations. It is often valuable to know the expected deflections for various reasons, so using an additional safety factor on drift calculations is not required."
    },
    {
        "problem_name": 17,
        "desc": "For which of the following scenarios is ro = 1.0",
        "answer": "All of the above",
        "answers": "[\"Designing a beam as a drag strut with an applied overstrength factor.\", \"Designing the anchorage of a 700 lb gas generator attached to the floor slab\", \"Designing telecommunication towers\", \"All of the above\"]",
        "answer_desc": "All of the above conditions are allowed to have ro=1.0 per ASCE 12.3.4.1. A drag strut is a common name for a collector (condition 2). Anchorage for a gas generator is a nonstructural component (condition 3). A telecommunication tower is a nonbuilding structure not similar to buildings (condition 4)."
    },
    {
        "problem_name": 18,
        "desc": "A single story masonry wall warehouse is being designed for mixed use. One half is to become a new fire station, the other half will be used for storage of a local farmer's hay stock. The fire station and hay storage will be separate by a single masonry wall that is used for the lateral system. Which of the following statements is correct:",
        "answer": "The entire warehouse should be designed as importance factor 1.50",
        "answers": "[\"The entire warehouse should be designed as importance factor 1.50\", \"The fire station should be designed as Importance factor 1.50, the warehouse should be designed as Importance Factor 1.00\", \"The entire warehouse should be designed as importance factor 1.25\", \"The walls closest to the fire station should be designed importance factor 1.50, the walls closest to the hay storage should be designed with importance factor 1.00\"]",
        "answer_desc": "Using ASCE Table 1.5-1, a fire station can be categorized as an essential facility for Risk Category IV. An agriculture storage structure would pose a small threat to human life because there would be no permanent occupants, so it is Risk Category I. Reading section 1.5.1, \"each building or other structure shall be assigned to the HIGHEST applicable risk cateogyr or categories.\" This informs us to use Risk Cateogry IV for the entire warehouse. Section 1.5.2 notes that the use of separate risk categories is appropriate only if the structures have independent structural systems. A single story masonry wall warehouse is its own structural system, even if there's a wall separating the two occupant types."
    },
    {
        "problem_name": 19,
        "desc": "A large movie theatre complex is being designed with the following site conditions: Ss = 0.9, S1 = 0.8. What is the Seismic Design Category?",
        "answer": "E",
        "answers": "[\"E\", \"B\", \"C\", \"D\"]",
        "answer_desc": "Per ASCE 7, the large occupancy of a movie theatre will qualify the structure as Risk Category III. When unsure of Risk Categories, check CBC Table 1604.5 for more verbose descriptions of the same categores. Per ASCE 7 Section 11.6, a risk Category III structure with S1 > 0.75 shall be automatically assigned to Seismic Design Category E."
    },
    {
        "problem_name": 20,
        "desc": "A uniform live load of 40 psf, where the design basis helicopter has a maximum take-off weight of _____pounds (13.35 kN) or less.",
        "answer": 3000,
        "answers": "[3000, 4000, 5000, 4500]",
        "answer_desc": "CBC 2019, CH 16, you can see more for how design helipads in 1607.6"
    },
    {
        "problem_name": 21,
        "desc": "What does a larger R value, the seismic response modification factor, mean for the ductility of a structure and its seismic base shear?",
        "answer": "Greater ductility and greater reduction to seismic base shear",
        "answers": "[\"Greater ductility and greater reduction to seismic base shear\", \"Greater ductility and smaller reduction to seismic base shear\", \"Smaller ductility and smaller reduction to seismic base shear\", \"Smaller ductility and greater reduction to seismic base shear\"]",
        "answer_desc": "As there is greater ductility, it will also lead to a greater R value since the R value is determined from the ductility. It will also have a greater reduction to the seismic base shear if we look at ASCE 7-16 equation 12.8-1 V=CsW. Notice how the seismic base shear is linear to the Cs value. Although there are multiple ways to calculate the Cs value, the R value is always in the denominator and therefore a larger R value means smaller Cs value which leads to a greater reduction to the seismic base shear."
    }
]